; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem satellite-94)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 sat5 sat6 sat7 sat8 sat9 sat10 - satellite
    ins1 ins2 ins3 ins4 ins5 ins6 ins7 ins8 ins9 ins10 ins11 ins12 ins13 ins14 ins15 ins16 ins17 ins18 ins19 - instrument
    mod1 mod2 mod3 - mode
    dir1 dir2 dir3 dir4 dir5 dir6 dir7 dir8 dir9 dir10 - direction
    )
 (:init 
    (pointing sat1 dir1)
    (pointing sat2 dir10)
    (pointing sat3 dir10)
    (pointing sat4 dir10)
    (pointing sat5 dir2)
    (pointing sat6 dir1)
    (pointing sat7 dir1)
    (pointing sat8 dir5)
    (pointing sat9 dir4)
    (pointing sat10 dir7)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (power_avail sat5)
    (power_avail sat6)
    (power_avail sat7)
    (power_avail sat8)
    (power_avail sat9)
    (power_avail sat10)
    (calibration_target ins1 dir4)
    (calibration_target ins2 dir5)
    (calibration_target ins3 dir5)
    (calibration_target ins4 dir7)
    (calibration_target ins5 dir1)
    (calibration_target ins6 dir6)
    (calibration_target ins7 dir5)
    (calibration_target ins8 dir9)
    (calibration_target ins9 dir2)
    (calibration_target ins10 dir7)
    (calibration_target ins11 dir2)
    (calibration_target ins12 dir2)
    (calibration_target ins13 dir10)
    (calibration_target ins14 dir6)
    (calibration_target ins15 dir6)
    (calibration_target ins16 dir1)
    (calibration_target ins17 dir8)
    (calibration_target ins18 dir3)
    (calibration_target ins19 dir10)
    (on_board ins1 sat2)
    (on_board ins2 sat10)
    (on_board ins3 sat4)
    (on_board ins4 sat3)
    (on_board ins5 sat9)
    (on_board ins6 sat8)
    (on_board ins7 sat1)
    (on_board ins8 sat5)
    (on_board ins9 sat7)
    (on_board ins10 sat6)
    (on_board ins11 sat5)
    (on_board ins12 sat6)
    (on_board ins13 sat9)
    (on_board ins14 sat1)
    (on_board ins15 sat5)
    (on_board ins16 sat4)
    (on_board ins17 sat7)
    (on_board ins18 sat5)
    (on_board ins19 sat7)
    (supports ins8 mod3)
    (supports ins4 mod3)
    (supports ins19 mod2)
    (supports ins14 mod1)
    (supports ins3 mod3)
    (supports ins9 mod3)
    (supports ins18 mod1)
    (supports ins2 mod2)
    (supports ins17 mod3)
    (supports ins16 mod1)
    (supports ins18 mod2)
    (supports ins12 mod3)
    (supports ins1 mod2)
    (supports ins16 mod3)
    (supports ins10 mod3)
    (supports ins14 mod2)
    (supports ins12 mod1)
    (supports ins11 mod2)
    (supports ins8 mod1)
    (supports ins3 mod2)
    (supports ins7 mod3)
    (supports ins11 mod1)
    (supports ins17 mod2)
    (supports ins1 mod1)
    (supports ins19 mod1)
    (supports ins8 mod2)
    (supports ins7 mod2)
    (supports ins6 mod3)
    (supports ins9 mod1)
    (supports ins13 mod2)
    (supports ins2 mod1)
    (supports ins11 mod3)
    (supports ins10 mod1)
    (supports ins5 mod2)
    (supports ins7 mod1)
    (supports ins3 mod1)
    (supports ins17 mod1)
    (supports ins12 mod2)
    (supports ins15 mod2))
 (:goal (and 
(have_image dir4 mod3)
(have_image dir5 mod3)
(have_image dir6 mod2)
(have_image dir7 mod3)
(have_image dir9 mod3)
(have_image dir10 mod2)
(pointing sat3 dir3)
))
)

; plan
1. (turn_to sat3 dir3 dir10)
   deleted: (pointing sat3 dir10)
   added: (pointing sat3 dir3)
   goals met: 1 of 7
2. (switch_on ins11 sat5)
   deleted: (power_avail sat5)
   added: (power_on ins11)
   goals met: 1 of 7
3. (calibrate sat5 ins11 dir2)
   added: (calibrated ins11)
   goals met: 1 of 7
4. (turn_to sat5 dir5 dir2)
   deleted: (pointing sat5 dir2)
   added: (pointing sat5 dir5)
   goals met: 1 of 7
5. (take_image sat5 dir5 ins11 mod3)
   added: (have_image dir5 mod3)
   goals met: 2 of 7
6. (turn_to sat5 dir10 dir5)
   deleted: (pointing sat5 dir5)
   added: (pointing sat5 dir10)
   goals met: 2 of 7
7. (take_image sat5 dir10 ins11 mod2)
   added: (have_image dir10 mod2)
   goals met: 3 of 7
8. (turn_to sat5 dir4 dir10)
   deleted: (pointing sat5 dir10)
   added: (pointing sat5 dir4)
   goals met: 3 of 7
9. (take_image sat5 dir4 ins11 mod3)
   added: (have_image dir4 mod3)
   goals met: 4 of 7
10. (turn_to sat5 dir9 dir4)
   deleted: (pointing sat5 dir4)
   added: (pointing sat5 dir9)
   goals met: 4 of 7
11. (take_image sat5 dir9 ins11 mod3)
   added: (have_image dir9 mod3)
   goals met: 5 of 7
12. (turn_to sat5 dir6 dir9)
   deleted: (pointing sat5 dir9)
   added: (pointing sat5 dir6)
   goals met: 5 of 7
13. (take_image sat5 dir6 ins11 mod2)
   added: (have_image dir6 mod2)
   goals met: 6 of 7
14. (turn_to sat5 dir7 dir6)
   deleted: (pointing sat5 dir6)
   added: (pointing sat5 dir7)
   goals met: 6 of 7
15. (take_image sat5 dir7 ins11 mod3)
   added: (have_image dir7 mod3)
   goals met: 7 of 7
